<template>
	<view class="login">
		<view class="login-wrap">
			<text class="com-info">火星收银</text>
			<view class="login-info">
				<input type="text" v-model="username" placeholder="请输入用户名..."/>
			</view>
			<view class="login-info">
				<input type="password" v-model="password" placeholder="请输入密码..."/>
			</view>
			<view class="do-login">
				<button type="primary" @click="doLogin">登录</button>
			</view>
			<view class="service-info">
				<view class="agree-btn-wrap" @click="isAgree=!isAgree">
					<view class="agree-out" >
						<view class="agree-in" v-if="isAgree">
						</view>
					</view>
				</view>
				<text class="agree-cont" @click="showServiceCont=true">同意用户服务协议</text>
			</view>
		</view>
		<view class="sel-store" v-if="showStoreList" @click="showStoreList=false">
			<view class="sel-store-wrap" @click.stop="">
				<scroll-view class="sc-view" scroll-y="true">
					<view class="store-item" v-for="(item,index) in storeArr" @click="selStore(item)" :key="index">
						{{item.storeName}}
					</view>
				</scroll-view>
			</view>
		</view>
		<view class="service-cont" v-if="showServiceCont" @click.stop="showServiceCont=false">
			<view class="service-cont-wrap" @click.stop="">
				<text class="tit">火星收银（星开台）用户登录/注册服务协议</text>
				<text>
					一、特别提示
					用户需在火星收银官网进行注册填写资料等（火星官网：https://admin.huoxingy.com）;
					(一)在此特别提醒用户在登录成为火星收银（星开台）用户之前，请认真阅读本用户服务协议》(以下简称协议)
					
					确保用户充分理解本协议中各条款，请审慎阅读并选择接受或不接受本协议。
					
					同意并点击确认本协议条款且完成登录程序后，才能成为火星收银（星开台）正式注册用户，并享受火星收银（星开台）各类服务。
					
					注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
					 
					若不同意本协议，或对本协议中的条款存在任何疑问，请立即停止
					
					火星收银（星开台） 用户注册程序，并可以选择不使用本程序服务。
					
					（二)本协议约定火星收银（星开台）与用户之间关于火星收银（星开台）服务(以下简称服务)的权利义务。
					
					用户是指注册、登录、使用本服务的个人、单位。
					
					本协议可由火星收银（星开台）负责人随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。
					
					在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用
					
					火星收银（星开台）提供的服务，用户继续使用火星收银（星开台）将被视为接受修改后的协议。
					
					二、账号注册
					（一)用户在使用本服务前需要注册一个火星收银（星开台）账号，火星收银（星开台）账号应当使用手机号码绑定注册，请用户使用尚未与账号绑定的手机号码，以及未被火星收银（星开台）根据本协议封禁的手机号码注册火星收银（星开台）账号。
					火星收银（星开台）可以根据用户需求或产品需要对账号注册和绑定的方式进行变
					更，而无须事先通知用户。
					
					(二)如果注册申请者有被火星收银（星开台）封禁的先例或涉嫌虚假注册及滥用他人名义注册，及其他不能得到许可的理由火星收银（星开台）将拒绝其注册申请。
					
					(3)鉴于火星收银（星开台）账号的绑定注册方式，用户同意火星收银（星开台）在注册时将允许用户的手机号码及手机设备识别码等信息用于注册。
					
					(四)在用户注册及使用本服务时，火星收银（星开台）需要搜集能识别用户身份
					的个人信息以便可以在必要时联系用户，或为用户提供更好的使用体验。
					火星收银（星开台）搜集的信息包括但不限于用户的姓名、地址：火星收银（星开台）意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。
					三、账户安全
					(一)用户一旦注册成功，成为火星收银（星开台）的用户，将得到一个用户名和密码，并有权利使用自己的用户名及密码随时登陆
					
					(2)用户对用户名和密码的安全负全部责任，同时对以其用户名进行的所有活动和事件负全责。
					(三)用户不得以任何形式擅自转让或授权他人使用自己的火星收银（星开台）户名
					(四)用户对密码加以妥善保管，切勿将密码告知他人，因密码保管不善而造成的所有损失由用户自行承担。
					(五)如果用户泄漏了密码，有可能导致不利的法律后果，因此不管任何原因导致用户的密码安全受到威胁，应该立即和火星收银（星开台）客服人员取得联系否则后果自负。
					四、用户声明与保证
					(一)用户承诺其为具有完全民事行为能力的民事主体，且具有达成交易履行其义务的能力
					(二)用户有义务在注册时提供自己的真实资料，并保证诸如手机号、姓名、所在地区等内容的有效性及安全性，保证火星收银（星开台）工作人员可以通过
					述联系方式与用户取得联系，同时，用户也有义务在相关资料实际变更时及时更新有关注册资料
					(三)用户通过使用火星收银（星开台）的过程中所制作、上载、复制、发布、传
					播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复和相关链接页面，以及其他使用账号或本服务所产生的内容，不得违反国家相关法律制度，包含但不限于如下原则
					1、违反宪法所确定的基本原则的
					
					2、危害国家安全，泄露国家秘密，颠覆国家政杈，破坏国家统一的
					
					3、损害国家荣誉和利益的
					
					4、煽动民族仇恨、民族歧视，破坏民族团结的
					
					5、破坏国家宗教政策，宣扬邪教和封建迷信的
					
					6、散布谣言，扰乱社会秩序，破坏社会稳
					
					7、散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教晙犯罪的
					
					8、侮辱或者诽谤他人，侵害他人合法权益的
					
					9、含有法律、行政法规禁止的其他内容的
					
					（四)用户不得利用火星收银（星开台）账号或本服务制作、上载、复制、发布
					
					传播等干扰火星收银（星开台）正常运营，以及侵犯其他用户或第三方合法权益的内容：
					
					1、含有任何性或性暗示的
					
					2、含有辱骂、恐吓、威胁内容的
					
					3、含有骚扰、垃圾广告、恶意信息、诱骗信息的
					
					4、涉及他人隐私、个人信息或资料的
					
					5、侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的
					
					6、含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。
					
					五、服务内容
					火星收银（星开台）有权随时审核或删除用户发布/传播的涉嫌违法或违反社会主义精神文明，或者被火星收银（星开台）认为不妥当的内容(包括但不限于文字、语音图片、视频、图文等)。
					
					所有发给用户的通告及其他消息都可通过APP或者用户所提供的联系方式发送。
					
					六、服务的终止
					(一)在下列情况下，火星收银（星开台）有权终止向用户提供服务
					
					1、在用户违反本服务协议相关规定时，有权终止向该用户提供服务；如该用户再一次直接或间接或以他人名义注册为用户，一经发现火星收银（星开台）有权直接单方面终止向该用户提供服务
					
					2、如火星收银（星开台）通过用户提供的信息与用户联系时，发现用户在注册时填写的联系方式已不存在或无法接通，火星收银（星开台）以其它联系方式通知用户更改，而用户在个工作日内仍未能提供新的联系方式，火星收银（星开台）有权终止向该用户提供服务。
					
					 
					
					3、用户不得通过程序或人工方式进行刷量或作弊，若发现用户有作弊行为，火星收银（星开台）将立即终止服务，并有权扣留账户内金额
					
					 
					
					4、一旦火星收银（星开台）发现用户提供的数据或信息中含有虚假内容有权随时终止向该用户提供服务。
					
					 
					
					5、本服务条款终止或更新时，用户明示不愿接受新的服务条款认为需终止服务的情况。
					
					 
					
					(二)服务终止后，火星收银（星开台）没有义务为用户保留原账号中或与之相关
					
					的任何信息，或转发任何未曾阅读或发送的信息给用户或第三方。
					
					 
					
					(三)用户理解并同意，即便在本协议终止及用户的服务被终止后火星收银（星开台）仍有权
					
					l、继续保存用户的用户信息
					
					2、继续向用户主张在其使用百姓网平台服务期间因违反法律法规、本协议及平台规则而应承担的责任
					
					七、服务的变更、中断
					(一)鉴于网络服务的特殊性，用户需同意火星收银（星开台）会变更、中断部分或全部的网络服务，并删除(不再保存)用户在使用过程中提交的任何资料而无需通知用户，也无需对任何用户或任何第三方承担任何责任。
					
					 
					
					（二）火星收银（星开台）需要定期或不定期地对提供网络服务的平台进行检测或者更新，如因此类情况而造成网络服务在合理时间内的中断火星收银（星开台）无需为此承担任何责任。
					
					八、服务条款修改
					（一）火星收银（星开台）有权随时修改本服务条款的任何内容，一旦本服务条款
					
					的任何内容发生变动，火星收银（星开台）将会通过适当方式向用户提示修改内容；
					
					 
					
					(二)如果不同意火星收银（星开台）对本服务条款所做的修改，用户有权停止使
					
					用网络服务。
					
					 
					
					(三)如果用户继续使用网络服务，则视为用户接受火星收银（星开台）对本服务条款所做的修改。
					
					九、免责与赔偿声明
					(一)若火星收银（星开台）已经明示其服务提供方式发生变更并提醒用户应当注
					
					意事项，用户未按要求操作所产生的一切后果由用户自行承担。
					
					 
					
					(二)用户明确同意其使用火星收银（星开台）所存在的风险将完全由其自己承担
					
					因其使用火星收银（星开台）而产生的一切后果也由其自己承担。
					
					 
					
					(三)用户同意保障和维护火星收银（星开台）及其他用户的利益，由于用户在使
					
					用火星收银（星开台）有违法、不真实、不正当、侵犯第三方合法权益的行为，或用户违反本协议项下的任何条款而给火星收银（星开台）任何其他第三方造成损失，用户同意承担由此造成的损害赔偿责任。
					
					十、隐私声明
					(一)适用范围
					
					1、在用户注册火星收银（星开台）账户时，根据要求提供的个人注册信息
					
					2、在用户使用火星收银（星开台）或访问其相关网页时，火星收银（星开台）自动接收
					
					并记录的用户浏览器上的服务器数值，包括但不限于IP地址等数据及用户要求取用的网页记录。
					
					 
					
					(二)信息使用
					
					1、火星收银（星开台）不会向任何人出售或出借用户的个人信息，除非事先得到用户的许可；
					
					2、火星收银（星开台）亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播用户的个人信息；
					
					任何用户如从事上述活动，一经发火星收银（星开台）有权立即终止与该用户
					
					的服务协议，查封其账号；
					
					3、为达到服务用户的目的火星收银（星开台）可能通过使用用户的个人信息向用户提供服务，包括但不限于向用户发出产品和服务信息，或者与火星收银（星开台）合作伙伴共享信息以便他们向用户发送有关其产品和服务的信息。
					
					(三)信息披露
					
					用户的个人信息将在下述情况下部分或全部被披露：
					
					1、经用户同意，向第三方披露；
					
					2、根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政司法机构披露；
					
					3、如果用户出现违反中国有关法律或者网站政策的情况，需要向第三方披露；
					
					4、为提供用户所要求的产品和服务，而必须和第三方分享用户的个人信息；
					
					5、其它火星收银（星开台）根据法律或者网站政策认为合适的披露
					
					6、用户使用火星收银（星开台）时提供的银行账户信息，火星收银（星开台）将严格履行相关保密约定。
					
					十一、其他
					（一）火星收银（星开台）郑重提醒用户注意本协议中免除火星收银（星开台）责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。
					
					未成年人应在法定监护人的陪同下阅读本协议。
					
					(二)本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律
					
					若用户和火星收银（星开台）之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交火星收银（星开台）住所地有管辖权的人民法院管辖。
					
					(三)本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力；
					
					(四)本协议最终解释权归火星收银（星开台）所有，并且保留一切解释和修改的权力；
					
					(五)本协议即日起适用。
				</text>
			</view>
		</view>
	</view>
</template>

<script>
	import { Base64 } from 'js-base64';
	import { login } from "./../../api/api.js";
	export default {
		data() {
			return {
				showServiceCont:false,
				isAgree:false,
				username:"",//用户名
				password:"",//密码
				showStoreList:false,
				storeArr:[],//店铺列表
			};
		},
		methods:{
			selStore(item){
				console.log(item);
				uni.setStorage({
				    key: 'storeId',
				    data: item.storeId
				});
				uni.setStorage({
				    key: 'storePayMode',
				    data: item.payMode
				});
				uni.setStorage({
				    key: 'empId',
				    data: item.employeeId
				});
				uni.setStorage({
				    key: 'empName',
				    data: item.employeeName
				});
				uni.navigateTo({
				    url: '../index/index'
				});
			},
			doLogin(){
				if(!this.isAgree){
					uni.showToast({
						icon:"none",
					    title: '用户服务协议未同意，不能进行登录。',
					    duration: 3000
					});
					return;
				}
				if(this.username==""||this.password==""){
					uni.showToast({
						icon:"none",
					    title: '请正确填写用户名和密码',
					    duration: 3000
					});
					return;
				}
				let data = {
					"username":this.username,
					"password":this.password
				}
				let token = "Basic "+Base64.encode(data.username + ":" + data.password);
				login(token).then(res=>{
					if(res.data.length){
						// 存储token
						uni.setStorage({
						    key: 'token',
						    data: token
						});
						uni.setStorage({
						    key: 'phone',
						    data: data.username
						});
						if(res.data.length>1){
							this.showStoreList = true;
							this.storeArr = res.data;
						}else{
							uni.setStorage({
							    key: 'storeId',
							    data: res.data[0].storeId
							});
							uni.setStorage({
							    key: 'storePayMode',
							    data: res.data[0].payMode
							});
							uni.setStorage({
							    key: 'empId',
							    data: res.data[0].employeeId
							});
							uni.setStorage({
							    key: 'empName',
							    data: res.data[0].employeeName
							});
							uni.navigateTo({
							    url: '../index/index'
							});
						}
					}else{
						uni.showToast({
							icon:"none",
						    title: '暂无店铺，请至后台注册。',
						    duration: 3000
						});
					}
				});
			}
		},
		onShow() {
			try {
			    uni.clearStorageSync();
			} catch (e) {
				//
			}
		},
		onUnload() {
			this.showStoreList = false;
			this.username = "";
			this.password = "";
		},
		onLoad() {
			try {
			    uni.clearStorageSync();
			} catch (e) {
				//
			}
		}
	}
</script>

<style lang="scss" scoped>
@import "./login.scss"
</style>
